fsi-setup/shared/fluid/cases/NASAsc2-0410_pimpleFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-6  -4  0.01)
    ( 14 -4  0.01)
    ( 14  4  0.01)
    (-6   4  0.01)
    (-6  -4  8)
    ( 14 -4  8)
    ( 14  4  8)
    (-6   4  8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 16 16) simpleGrading (1 1 1)
);

edges
(
);

boundary (

    domainWalls
    {
        type patch;
        faces
        (
	    (1 5 4 0)
	    (3 7 6 2)
	    (4 5 6 7)
        (0 1 2 3)
        );
    }

    inlet
    {
        type patch;
        faces
	(
	    (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
);


// ************************************************************************* //
