fsi-setup/shared/fluid/cases/NASAsc2-0410_pimpleFoam/system/solverInfo

// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

fields      ( p U e k omega );


// ************************************************************************* //
